<?xml version="1.0"?>
<CastXML format="1.1.5">
  <Namespace id="_1" name="::" members="_2 _3 _4 _5 _6 _7 _8 _9 _10 _11 _12 _13 _14 _15 _16 _17 _18 _19 _20 _21 _22 _23 _24 _25 _26 _27 _28 _29 _30 _31 _32 _33 _34 _35 _36 _37 _38 _39 _40 _41 _42 _43 _44 _45 _46 _47 _48 _49 _50 _51 _52 _53 _54 _55 _56 _57 _58 _59 _60 _61 _62 _63 _64 _65 _66 _67 _68 _69 _70 _71 _72 _73 _74 _75 _76 _77 _78 _79 _80 _81 _82 _83 _84 _85 _86 _87 _88 _89 _90 _91 _92 _93 _94 _95 _96 _97 _98 _99 _100 _101 _102 _103 _104 _105 _106 _107 _108 _109 _110 _111 _112 _113 _114 _115 _116 _117 _118 _119 _120 _121 _122 _123 _124 _125 _126 _127 _128 _129 _130 _131 _132 _133 _134 _135 _136 _137 _138 _139 _140 _141 _142 _143 _144 _145 _146 _147 _148 _149 _150 _151 _152 _153 _154 _155 _156 _157 _158 _159 _160 _161 _162 _163 _164 _165 _166 _167 _168 _169 _170 _171 _172 _173 _174 _175 _176 _177 _178 _179 _180 _181 _182 _183 _184 _185 _186 _187 _188 _189 _190"/>
  <Typedef id="_2" name="__int128_t" type="_191" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_3" name="__uint128_t" type="_192" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_4" name="__NSConstantString" type="_193" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_5" name="__builtin_ms_va_list" type="_194" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_6" name="__builtin_va_list" type="_195" context="_1" location="f0:0" file="f0" line="0"/>

  <Function id="_174" name="glfwUpdateGamepadMappings" returns="_198" context="_1" location="f4:5101" file="f4" line="5101" mangled="_Z25glfwUpdateGamepadMappings">
    <Argument name="string" type="_245" location="f4:5101" file="f4" line="5101"/>
  </Function>
  <Function id="_175" name="glfwGetGamepadName" returns="_245" context="_1" location="f4:5131" file="f4" line="5131" mangled="_Z18glfwGetGamepadName">
    <Argument name="jid" type="_198" location="f4:5131" file="f4" line="5131"/>
  </Function>
  <Function id="_176" name="glfwGetGamepadState" returns="_198" context="_1" location="f4:5169" file="f4" line="5169" mangled="_Z19glfwGetGamepadState">
    <Argument name="jid" type="_198" location="f4:5169" file="f4" line="5169"/>
    <Argument name="state" type="_261" location="f4:5169" file="f4" line="5169"/>
  </Function>
  <Function id="_177" name="glfwSetClipboardString" returns="_243" context="_1" location="f4:5194" file="f4" line="5194" mangled="_Z22glfwSetClipboardString">
    <Argument name="window" type="_254" location="f4:5194" file="f4" line="5194"/>
    <Argument name="string" type="_245" location="f4:5194" file="f4" line="5194"/>
  </Function>
  <Function id="_178" name="glfwGetClipboardString" returns="_245" context="_1" location="f4:5224" file="f4" line="5224" mangled="_Z22glfwGetClipboardString">
    <Argument name="window" type="_254" location="f4:5224" file="f4" line="5224"/>
  </Function>
  <Function id="_179" name="glfwGetTime" returns="_256" context="_1" location="f4:5254" file="f4" line="5254" mangled="_Z11glfwGetTime"/>
  <Function id="_180" name="glfwSetTime" returns="_243" context="_1" location="f4:5284" file="f4" line="5284" mangled="_Z11glfwSetTime">
    <Argument name="time" type="_256" location="f4:5284" file="f4" line="5284"/>
  </Function>
  <Function id="_181" name="glfwGetTimerValue" returns="_12" context="_1" location="f4:5306" file="f4" line="5306" mangled="_Z17glfwGetTimerValue"/>
  <Function id="_182" name="glfwGetTimerFrequency" returns="_12" context="_1" location="f4:5326" file="f4" line="5326" mangled="_Z21glfwGetTimerFrequency"/>
  <Function id="_183" name="glfwMakeContextCurrent" returns="_243" context="_1" location="f4:5364" file="f4" line="5364" mangled="_Z22glfwMakeContextCurrent">
    <Argument name="window" type="_254" location="f4:5364" file="f4" line="5364"/>
  </Function>
  <Function id="_184" name="glfwGetCurrentContext" returns="_254" context="_1" location="f4:5385" file="f4" line="5385" mangled="_Z21glfwGetCurrentContext"/>
  <Function id="_185" name="glfwSwapBuffers" returns="_243" context="_1" location="f4:5419" file="f4" line="5419" mangled="_Z15glfwSwapBuffers">
    <Argument name="window" type="_254" location="f4:5419" file="f4" line="5419"/>
  </Function>
  <Function id="_186" name="glfwSwapInterval" returns="_243" context="_1" location="f4:5465" file="f4" line="5465" mangled="_Z16glfwSwapInterval">
    <Argument name="interval" type="_198" location="f4:5465" file="f4" line="5465"/>
  </Function>
  <Function id="_187" name="glfwExtensionSupported" returns="_198" context="_1" location="f4:5503" file="f4" line="5503" mangled="_Z22glfwExtensionSupported">
    <Argument name="extension" type="_245" location="f4:5503" file="f4" line="5503"/>
  </Function>
  <Function id="_188" name="glfwGetProcAddress" returns="_39" context="_1" location="f4:5545" file="f4" line="5545" mangled="_Z18glfwGetProcAddress">
    <Argument name="procname" type="_245" location="f4:5545" file="f4" line="5545"/>
  </Function>
  <Function id="_189" name="glfwVulkanSupported" returns="_198" context="_1" location="f4:5573" file="f4" line="5573" mangled="_Z19glfwVulkanSupported"/>
  <Function id="_190" name="glfwGetRequiredInstanceExtensions" returns="_246" context="_1" location="f4:5621" file="f4" line="5621" mangled="_Z33glfwGetRequiredInstanceExtensions">
    <Argument name="count" type="_262" location="f4:5621" file="f4" line="5621"/>
  </Function>
  <FundamentalType id="_191" name="__int128" size="128" align="128"/>
  <FundamentalType id="_192" name="unsigned __int128" size="128" align="128"/>
  <Struct id="_193" name="__NSConstantString_tag" context="_1" location="f0:0" file="f0" line="0" members="_263 _264 _265 _266" size="256" align="64"/>
  <PointerType id="_194" type="_267" size="64" align="64"/>
  <ArrayType id="_195" min="0" max="0" type="_268"/>
  <FundamentalType id="_196" name="long int" size="64" align="64"/>
  <FundamentalType id="_197" name="long unsigned int" size="64" align="64"/>
  <FundamentalType id="_198" name="int" size="32" align="32"/>
  <FundamentalType id="_199" name="long double" size="128" align="128"/>
  <FundamentalType id="_200" name="long long int" size="64" align="64"/>
  <FundamentalType id="_201" name="long long unsigned int" size="64" align="64"/>
  <FundamentalType id="_202" name="unsigned int" size="32" align="32"/>
  <FundamentalType id="_203" name="short int" size="16" align="16"/>
  <FundamentalType id="_204" name="short unsigned int" size="16" align="16"/>
  <FundamentalType id="_205" name="signed char" size="8" align="8"/>
  <FundamentalType id="_206" name="unsigned char" size="8" align="8"/>
  <PointerType id="_207" type="_269" size="64" align="64"/>
  <ElaboratedType id="_208" type="_41"/>
  <ElaboratedType id="_209" type="_43"/>
  <ElaboratedType id="_210" type="_45"/>
  <PointerType id="_211" type="_270" size="64" align="64"/>
  <PointerType id="_212" type="_271" size="64" align="64"/>
  <PointerType id="_213" type="_272" size="64" align="64"/>
  <PointerType id="_214" type="_273" size="64" align="64"/>
  <PointerType id="_215" type="_274" size="64" align="64"/>
  <PointerType id="_216" type="_275" size="64" align="64"/>
  <PointerType id="_217" type="_276" size="64" align="64"/>
  <PointerType id="_218" type="_277" size="64" align="64"/>
  <PointerType id="_219" type="_278" size="64" align="64"/>
  <PointerType id="_220" type="_279" size="64" align="64"/>
  <PointerType id="_221" type="_280" size="64" align="64"/>
  <PointerType id="_222" type="_281" size="64" align="64"/>
  <PointerType id="_223" type="_282" size="64" align="64"/>
  <Field id="_224" name="width" type="_198" context="_67" access="public" location="f4:1557" file="f4" line="1557" offset="0"/>
  <Field id="_225" name="height" type="_198" context="_67" access="public" location="f4:1560" file="f4" line="1560" offset="32"/>
  <Field id="_226" name="redBits" type="_198" context="_67" access="public" location="f4:1563" file="f4" line="1563" offset="64"/>
  <Field id="_227" name="greenBits" type="_198" context="_67" access="public" location="f4:1566" file="f4" line="1566" offset="96"/>
  <Field id="_228" name="blueBits" type="_198" context="_67" access="public" location="f4:1569" file="f4" line="1569" offset="128"/>
  <Field id="_229" name="refreshRate" type="_198" context="_67" access="public" location="f4:1572" file="f4" line="1572" offset="160"/>
  <ElaboratedType id="_230" type="_67"/>
  <Field id="_231" name="red" type="_283" context="_69" access="public" location="f4:1591" file="f4" line="1591" offset="0"/>
  <Field id="_232" name="green" type="_283" context="_69" access="public" location="f4:1594" file="f4" line="1594" offset="64"/>
  <Field id="_233" name="blue" type="_283" context="_69" access="public" location="f4:1597" file="f4" line="1597" offset="128"/>
  <Field id="_234" name="size" type="_202" context="_69" access="public" location="f4:1600" file="f4" line="1600" offset="192"/>
  <ElaboratedType id="_235" type="_69"/>
  <Field id="_236" name="width" type="_198" context="_71" access="public" location="f4:1620" file="f4" line="1620" offset="0"/>
  <Field id="_237" name="height" type="_198" context="_71" access="public" location="f4:1623" file="f4" line="1623" offset="32"/>
  <Field id="_238" name="pixels" type="_284" context="_71" access="public" location="f4:1626" file="f4" line="1626" offset="64"/>
  <ElaboratedType id="_239" type="_71"/>
  <Field id="_240" name="buttons" type="_285" context="_73" access="public" location="f4:1645" file="f4" line="1645" offset="0"/>
  <Field id="_241" name="axes" type="_286" context="_73" access="public" location="f4:1649" file="f4" line="1649" offset="128"/>
  <ElaboratedType id="_242" type="_73"/>
  <FundamentalType id="_243" name="void" size="0" align="8"/>
  <PointerType id="_244" type="_198" size="64" align="64"/>
  <PointerType id="_245" type="_267c" size="64" align="64"/>
  <PointerType id="_246" type="_245" size="64" align="64"/>
  <PointerType id="_247" type="_248" size="64" align="64"/>
  <PointerType id="_248" type="_42" size="64" align="64"/>
  <PointerType id="_249" type="_252" size="64" align="64"/>
  <PointerType id="_250" type="_243" size="64" align="64"/>
  <PointerType id="_251" type="_68c" size="64" align="64"/>
  <CvQualifiedType id="_68c" type="_68" const="1"/>
  <FundamentalType id="_252" name="float" size="32" align="32"/>
  <PointerType id="_253" type="_70c" size="64" align="64"/>
  <CvQualifiedType id="_70c" type="_70" const="1"/>
  <PointerType id="_254" type="_44" size="64" align="64"/>
  <PointerType id="_255" type="_72c" size="64" align="64"/>
  <CvQualifiedType id="_72c" type="_72" const="1"/>
  <FundamentalType id="_256" name="double" size="64" align="64"/>
  <PointerType id="_257" type="_256" size="64" align="64"/>
  <PointerType id="_258" type="_46" size="64" align="64"/>
  <PointerType id="_259" type="_252c" size="64" align="64"/>
  <CvQualifiedType id="_252c" type="_252" const="1"/>
  <PointerType id="_260" type="_206c" size="64" align="64"/>
  <CvQualifiedType id="_206c" type="_206" const="1"/>
  <PointerType id="_261" type="_74" size="64" align="64"/>
  <PointerType id="_262" type="_18" size="64" align="64"/>
  <Field id="_263" name="isa" type="_287" context="_193" access="public" offset="0"/>
  <Field id="_264" name="flags" type="_198" context="_193" access="public" offset="64"/>
  <Field id="_265" name="str" type="_245" context="_193" access="public" offset="128"/>
  <Field id="_266" name="length" type="_196" context="_193" access="public" offset="192"/>
  <CvQualifiedType id="_267c" type="_267" const="1"/>
  <Struct id="_268" name="__va_list_tag" context="_1" location="f0:0" file="f0" line="0" members="_288 _289 _290 _291" size="192" align="64"/>
  <PointerType id="_283" type="_204" size="64" align="64"/>
  <PointerType id="_284" type="_206" size="64" align="64"/>
  <ArrayType id="_285" min="0" max="14" type="_206"/>
  <ArrayType id="_286" min="0" max="5" type="_252"/>
  <PointerType id="_287" type="_198c" size="64" align="64"/>
  <CvQualifiedType id="_198c" type="_198" const="1"/>
  <Field id="_288" name="gp_offset" type="_202" context="_268" access="public" offset="0"/>
  <Field id="_289" name="fp_offset" type="_202" context="_268" access="public" offset="32"/>
  <Field id="_290" name="overflow_arg_area" type="_250" context="_268" access="public" offset="64"/>
  <Field id="_291" name="reg_save_area" type="_250" context="_268" access="public" offset="128"/>
  <FundamentalType id="_267" name="char" size="8" align="8"/>
  <FunctionType id="_269" returns="_243"/>
  <FunctionType id="_270" returns="_243">
    <Argument type="_198"/>
    <Argument type="_245"/>
  </FunctionType>
  <FunctionType id="_271" returns="_243">
    <Argument type="_254"/>
    <Argument type="_198"/>
    <Argument type="_198"/>
  </FunctionType>
  <FunctionType id="_272" returns="_243">
    <Argument type="_254"/>
  </FunctionType>
  <FunctionType id="_273" returns="_243">
    <Argument type="_254"/>
    <Argument type="_198"/>
  </FunctionType>
  <FunctionType id="_274" returns="_243">
    <Argument type="_254"/>
    <Argument type="_252"/>
    <Argument type="_252"/>
  </FunctionType>
  <FunctionType id="_275" returns="_243">
    <Argument type="_254"/>
    <Argument type="_198"/>
    <Argument type="_198"/>
    <Argument type="_198"/>
  </FunctionType>
  <FunctionType id="_276" returns="_243">
    <Argument type="_254"/>
    <Argument type="_256"/>
    <Argument type="_256"/>
  </FunctionType>
  <FunctionType id="_277" returns="_243">
    <Argument type="_254"/>
    <Argument type="_198"/>
    <Argument type="_198"/>
    <Argument type="_198"/>
    <Argument type="_198"/>
  </FunctionType>
  <FunctionType id="_278" returns="_243">
    <Argument type="_254"/>
    <Argument type="_202"/>
  </FunctionType>
  <FunctionType id="_279" returns="_243">
    <Argument type="_254"/>
    <Argument type="_202"/>
    <Argument type="_198"/>
  </FunctionType>
  <FunctionType id="_280" returns="_243">
    <Argument type="_254"/>
    <Argument type="_198"/>
    <Argument type="_246"/>
  </FunctionType>
  <FunctionType id="_281" returns="_243">
    <Argument type="_248"/>
    <Argument type="_198"/>
  </FunctionType>
  <FunctionType id="_282" returns="_243">
    <Argument type="_198"/>
    <Argument type="_198"/>
  </FunctionType>
  <File id="f0" name="&lt;builtin&gt;"/>
  <File id="f1" name="/usr/local/Cellar/castxml/0.2.0/share/castxml/clang/include/stddef.h"/>
  <File id="f2" name="/usr/local/Cellar/castxml/0.2.0/share/castxml/clang/include/__stddef_max_align_t.h"/>
  <File id="f3" name="/usr/local/Cellar/castxml/0.2.0/share/castxml/clang/include/stdint.h"/>
  <File id="f4" name="./include/c/glfw3.h"/>
</CastXML>
